#+BLOG: myblog
#+POSTID: 176
#+TITLE: Shell
#+DATE: [2021-11-26 Fri 19:55]
#+STARTUP: overview
#+CATEGORY: Shell
*** ~$[]~
#+begin_src shell
num=1
age=$[num+2]
$[age2=num+200]
echo $num,$age,$age2
#+end_src

#+RESULTS:
| 1 | 3 | 201 |

** String value compare
1. ~=~ equal(String)
   #+begin_src shell
if [[ "a" = "a" ]]; then
    echo "equal"
fi
   #+end_src
2. ~!=~ not euqal(String)
   #+begin_src shell
if [[ "a" != "A" ]]; then
    echo "Not equal"
else
    echo "Equal"
fi
   #+end_src
3. ~-n~ if variable is not null, then return true(0), else false(no-0)
   #+begin_src shell
name=""
if [[ -n "$name" ]]; then
    echo "It isn't null"
else
    echo "It's null"
fi
   #+end_src

   #+RESULTS:
   : It's null
4. ~-z~ if variable is null, return true(0), oppsite of ~-z~
   #+begin_src shell
name=""
if [[ -n "$name" ]]; then
    echo "It isn't null"
else
    echo "It's null"
fi
   #+end_src
